Repository: sinemgungor/BaSalesManagementApp
Catalog: BaSalesManagementApp.MVC/Resources/Resource.*.resx
Languages: tr_tr

# PROMOTION_TOTAL_PRICE_GREATER_THAN_ZERO
source: Promotion total price must be greater than zero.
tr_tr: Promosyon Toplam fiyatı sıfırdan büyük olmalıdır.

# PROMOTION_TOTAL_PRICE_REQUIRED
source: Promotion total price is required.
tr_tr: Promosyon Toplam fiyatı zorunludur.

# PROMOTION_UPDATE_ERROR
source: An error occurred while updating the promotion.
tr_tr: Promosyon Güncelleme Başarısız.

# PROMOTION_UPDATE_SUCCESS
source: The promotion has been successfully updated.
tr_tr: Promosyon Güncelleme Başarılı.

# STUDENT_ADDED_SUCCESS
source: Student Has Been Added Successfully.
tr_tr: Öğrenci Ekleme Başarılı.

# STUDENT_BROUGHT_SUCCESS
source: Student Has Been Brought Successfully.
tr_tr: Öğrenci Getirme Başarılı.

# STUDENT_DELETED_SUCCESS
source: Student Has Been Deleted Successfully.
tr_tr: Öğrenci Silme Başarılı.

# STUDENT_LISTED_SUCCESS
source: Student Has Been Listed Successfully.
tr_tr: Öğrenci Listeleme Başarılı.

# Warehouse_CREATED_SUCCESS
source: The warehouse was successfully created.
tr_tr: Depo başarıyla oluşturuldu.

# Warehouse_CREATE_FAILED
source: An error occurred while creating the warehouse.
tr_tr: Depo oluşturulurken bir hata meydana geldi.

# Warehouse_DELETED_SUCCESS
source: The warehouse was successfully deleted.
tr_tr: Depo başarıyla silindi.

# Warehouse_DELETE_FAILED
source: An error occurred while deleting the warehouse.
tr_tr: Depo silinirken bir hata meydana geldi.

# Warehouse_FOUND_SUCCESS
source: The warehouse was successfully found.
tr_tr: Depo başarıyla bulundu.

# Warehouse_GET_FAILED
source: The warehouse could not be retrieved.
tr_tr: Depo getirilemedi.

# Warehouse_LISTED_SUCCESS
source: The warehouse list was successfully retrieved.
tr_tr: Depo başarıyla listelendi.

# Warehouse_LIST_EMPTY
source: The warehouse list is empty.
tr_tr: Depo listesi boş.

# Warehouse_LIST_FAILED
source: An error occurred while retrieving the warehouse list.
tr_tr: Depo listesi getirilirken bir hata meydana geldi.

# Warehouse_MAX_LENGTH
source: Warehouse name cannot exceed 128 characters
tr_tr: Depo adı 128 karakterden fazla girilemez

# Warehouse_MIN_LENGTH
source: Warehouse name must be longer than 2 characters
tr_tr: Depo adı 2 karakterden fazla olmalı

# Warehouse_NOT_EMPTY
source: Warehouse name cannot be empty
tr_tr: Depo adı boş bırakılamaz

# Warehouse_NOT_FOUND
source: The warehouse was not found.
tr_tr: Depo bulunamadı.

# Warehouse_UPDATED_SUCCESS
source: The warehouse was successfully updated.
tr_tr: Depo başarıyla güncellendi.

# Warehouse_UPDATE_FAILED
source: An error occurred while updating the warehouse.
tr_tr: Depo güncellenirken bir hata meydana geldi.

# PRODUCTTYPE_ADD_SUCCESS
source: Product type was added successfully
tr_tr: Ürün tipi başarılı bir şekilde eklendi

# PRODUCTTYPE_ADD_UNSUCCESS
source: Product type added process is unsuccess
tr_tr: Ürün tipi ekleme işlemi başarısız

# PRODUCTTYPE_DELETE_SUCCESS
source: Product type was deleted successfully
tr_tr: Ürün tipi başarılı bir şekilde silindi

# PRODUCTTYPE_DELETE_UNSUCCESS
source: Product type deleted process is unsuccess
tr_tr: Ürün tipi silme işlemi başarısız

# PRODUCTTYPE_DESCRIPTION_MAXIMUM_LENGTH
source: Description field cannot exceed 128 characters.
tr_tr: Açıklama alanı 128 karakterden uzun olamaz.

# PRODUCTTYPE_DESCRIPTION_MINIMUM_LENGTH
source: Description field must be longer than 2 characters.
tr_tr: Açıklama alanı 2 karakterden az olamaz.

# PRODUCTTYPE_DESCRIPTION_NOT_EMPTY
source: Description field cannot be empty
tr_tr: Açıklama alanı boş bırakılamaz.

# PRODUCTTYPE_GETBYID_SUCCESS
source: Product type was brought successfully
tr_tr: Ürün tipi başarılı bir şekilde getirildi

# PRODUCTTYPE_GETBYID_UNSUCCESS
source: Product type fetch process is unsuccess
tr_tr: Ürün tipi getirme işlemi başarısız

# PRODUCTTYPE_LISTED_NOTFOUND
source: Product type was not found
tr_tr: Listelenecek ürün tipi bulunamadı

# PRODUCTTYPE_LISTED_SUCCESS
source: Product type was listed successfully
tr_tr: Ürün tipleri başarılı bir şekilde listelendi

# PRODUCTTYPE_LISTED_UNSUCCESS
source: Product type listed process is unsuccess
tr_tr: Ürün tipi listeleme işlemi başarısız

# PRODUCTTYPE_NAME_MAXIMUM_LENGTH
source: The product type name field cannot exceed 128 characters.
tr_tr: İsim alanı 128 karakterden uzun olamaz.

# PRODUCTTYPE_NAME_MINIMUM_LENGTH
source: The product type name must be longer than 2 characters.
tr_tr: Ürün tipi adı 2 karakterden az olamaz.

# PRODUCTTYPE_NAME_NOT_EMPTY
source: Name field cannot be empty
tr_tr: İsim alanı boş bırakılamaz.

# PRODUCTTYPE_UPDATE_SUCCESS
source: Product type was updated successfully
tr_tr: Ürün tipi başarılı bir şekilde güncellendi

# PRODUCTTYPE_UPDATE_UNSUCCESS
source: Product type updated process is unsuccess
tr_tr: Ürün tipi güncelleme işlemi başarısız

# PRODUCT_CREATED_ERROR
source: An Error Occurred while Creating the Product.
tr_tr: Ürün Oluşturulurken Bir Hata Meydana Geldi

# PRODUCT_CREATED_SUCCESS
source: Product Created Successfully.
tr_tr: Ürün Başarıyla Eklendi.

# PRODUCT_DELETED_ERROR
source: An Error Occurred while Deleting the Product.
tr_tr: Ürün Silinirken Bir Hata Meydana Geldi

# PRODUCT_DELETED_SUCCESS
source: Product Deleted Successfully.
tr_tr: Ürün Başarıyla Silindi.

# PRODUCT_GET_SUCCESS
source: The Product list was Successfully Retrieved.
tr_tr: Ürün Başarılı Bir Şekilde Getirildi.

# PRODUCT_LISTED_EMPTY
source: Product List is Empty.
tr_tr: Ürün Listesi Boş

# PRODUCT_LISTED_ERROR
source: An Error Occurred while Listing the Product.
tr_tr: Ürün Listelenirken Bir Hata Meydana Geldi

# PRODUCT_LISTED_SUCCESS
source: Product Listed Successfully.
tr_tr: Ürün Başarıyla Listelendi.

# PRODUCT_NAME_CANNOT_BE_EMPTY
source: This Field Cannot Be Empty!
tr_tr: Bu Alan Boş Bırakılamaz

# PRODUCT_NAME_CANNOT_CONTAIN_NUMBER
source: Name Can Not Contain Number!
tr_tr: İsim sayı içermemelidir

source: Product Not Found!
tr_tr: Ürün Bulunamadı

# PRODUCT_PRICE_MUST_BE_GREATER_THAN_ZERO
source: Price Must Be Greater Than Zero!
tr_tr: Fiyat sıfırdan büyük olmalıdır

# PRODUCT_PRICE_MUST_HAVE_NO_MORE_THAN_TWO_DECIMAL_PLACES
source: Price Must be Up To 18 Digits With 2 Decimal Places.
tr_tr: Fiyat en fazla 18 haneli ve 2 ondalık basamaklı olabilir.

# PRODUCT_UPDATED_ERROR
source: An Error Occurred while Updating the Product.
tr_tr: Ürün Güncellenirken Bir Hata Meydana Geldi

# PRODUCT_UPDATED_SUCCESS
source: Product Updated Successfully.
tr_tr: Ürün Başarıyla Güncellendi.

# CUSTOMER_ADDRESS_MAXIMUM_LENGTH
source: Cannot exceed 128 characters
tr_tr: 128 karakteri geçemez

# CUSTOMER_ADDRESS_MINIMUM_LENGTH
source: Must be at least 2 characters long
tr_tr: En az 2 karakter uzunluğunda olmalıdır

# CUSTOMER_ADDRESS_NOT_EMPTY
source: Customer address cannot be empty.
tr_tr: Müşteri adresi boş olamaz.

# CUSTOMER_MATCHES
source: Invalid customer phone
tr_tr: Geçersiz müşteri telefonu

# CUSTOMER_NAME_MAXIMUM_LENGTH
source: Cannot exceed 128 characters
tr_tr: 128 karakteri geçemez!

# CUSTOMER_NAME_MINIMUM_LENGTH
source: Must be at least 2 characters long
tr_tr: En az 2 karakter uzunluğunda olmalıdır

# CUSTOMER_NAME_NOT_EMPTY
source: Customer name cannot be empty.
tr_tr: Müşteri adı boş olamaz.

# CUSTOMER_PHONE_MAXIMUM_LENGTH
source: Cannot exceed 40 digits
tr_tr: 40 basamağı geçemez!

# CUSTOMER_PHONE_MINIMUM_LENGTH
source: Must be at least 10 digits long
tr_tr: En az 10 basamak uzunluğunda olmalıdır

# CUSTOMER_PHONE_NOT_EMPTY
source: Customer phone number cannot be empty.
tr_tr: Müşteri telefon numarası boş olamaz.

# BRANCH_ADDRESS_MAXIMUM_LENGTH
source: More than 128 characters cannot be entered in the branch address
tr_tr: Şube adresine 128 karakterden fazla girilemez

# BRANCH_ADDRESS_MINIMUM_LENGTH
source: At least 2 characters must be entered in the branch address
tr_tr: Şube adresine en az 2 karakter girilmeli

# BRANCH_ADDRESS_NOT_EMPTY
source: Branch address cannot be null!
tr_tr: Şube adresi Boş Bırakılamaz.

# BRANCH_ADD_ERROR
source: Branch Could Not Be Added!
tr_tr: Şube Ekleme Başarısız.

# BRANCH_ADD_SUCCESS
source: Branch Has Been Added Successfully
tr_tr: Şube Ekleme Başarılı.

# BRANCH_DELETE_ERROR
source: Branch Could Not Be Deleted
tr_tr: Şube Silme Başarısız.

# BRANCH_DELETE_SUCCESS
source: Branch Has Been Deleted Successfully
tr_tr: Şube Silme Başarılı.

# BRANCH_GETBYID_ERROR
source: Failed to Bring Branch!
tr_tr: Şube Getirme Başarısız.

# BRANCH_GETBYID_SUCCESS
source: Branch Has Been Brought Successfully
tr_tr: Şube Getirme Başarılı.

# BRANCH_LISTED_ERROR
source: Branch Not Listed
tr_tr: Şube Listeleme Başarısız.

# BRANCH_LISTED_NOTFOUND
source: Branch Not Found
tr_tr: Şube Bulunamadı.

# BRANCH_LISTED_SUCCESS
source: Branch Has Been Listed Successfully
tr_tr: Şube Listeleme Başarılı.

# BRANCH_NAME_MAXIMUM_LENGTH
source: More than 128 characters cannot be entered in the branch name
tr_tr: Şube adına 128 karakterden fazla girilemez

# BRANCH_NAME_MINIMUM_LENGTH
source: At least 2 characters must be entered in the branch name
tr_tr: Şube adına en az 2 karakter girilmeli

# BRANCH_NAME_NOT_EMPTY
source: Branch name cannot be null
tr_tr: Şube adı boş bırakılamaz.

# BRANCH_UPDATE_ERROR
source: Branch Could Not Be Updated
tr_tr: Şube Güncelleme Başarısız.

# BRANCH_UPDATE_SUCCESS
source: Branch Has Been Updated Successfully
tr_tr: Şube Güncelleme Başarılı.

# ADMIN_CREATED_SUCCESS
source: The admin was successfully created.
tr_tr: Yönetici başarıyla oluşturuldu.

# ADMIN_CREATE_ERROR
source: An error occurred while creating the admin.
tr_tr: Yönetici oluşturulurken bir hata meydana geldi.

# ADMIN_DELETED_SUCCESS
source: The admin was successfully deleted.
tr_tr: Yönetici başarıyla silindi.

# ADMIN_DELETE_ERROR
source: An error occurred while deleting the admin.
tr_tr: Yönetici silinirken bir hata meydana geldi.

# ADMIN_EMAIL_IN_USE
source: This e-mail address is already being used.
tr_tr: Bu e-posta adresi zaten kullanılıyor.

# ADMIN_E_MAIL_FIELD_IS_REQUIRED
source: The e-mail field is mandatory.
tr_tr: E-posta alanı zorunludur.

# ADMIN_GETBYID_ERROR
source: The admin could not be found.
tr_tr: Yönetici bulunamadı.

# ADMIN_LISTED_ERROR
source: An error occurred while listing the admin.
tr_tr: Yönetici listelenirken bir hata meydana geldi.

# ADMIN_LISTED_NOTFOUND
source: No Admin was found.
tr_tr: Hiçbir Admin bulunamadı.

# ADMIN_LISTED_SUCCESS
source: Admin has been successfully listed.
tr_tr: Yönetici başarıyla listelendi.

# ADMIN_NAMESPACE_IS_REQUIRED
source: The namespace is mandatory.
tr_tr: Ad alanı zorunludur.

# ADMIN_NAME_MAX_LENGTH_ERROR
source: The name cannot be longer than 50 characters.
tr_tr: Ad 50 karakterden uzun olamaz.

# ADMIN_NAME_MIN_LENGTH_ERROR
source: The name cannot be less than 2 characters.
tr_tr: Ad 2 karakterden az olamaz.

# ADMIN_NAME_NUMERIC_FORBIDDEN
source: Numeric characters cannot be used in the namespace.
tr_tr: Ad alanında sayısal karakter kullanılamaz.

# ADMIN_PHOTO_SIZE_EXCEEDS_LIMIT
source: The photo size cannot be more than 500 KB.
tr_tr: Fotoğraf boyutu 500 KB'dan fazla olamaz.

# ADMIN_SURNAME_FIELD_IS_REQUIRED
source: The last name field is mandatory.
tr_tr: Soyad alanı zorunludur.

# ADMIN_SURNAME_MAX_LENGTH_ERROR
source: The last name cannot be longer than 50 characters.
tr_tr: Soyad 50 karakterden uzun olamaz.

# ADMIN_SURNAME_MIN_LENGTH_ERROR
source: The last name cannot be less than 2 characters.
tr_tr: Soyad 2 karakterden az olamaz.

# ADMIN_SURNAME_NUMERIC_FORBIDDEN
source: Numeric characters cannot be used in the last name field.
tr_tr: Soyad alanında sayısal karakter kullanılamaz.

# ADMIN_UPDATE_ERROR
source: An error occurred during the admin update.
tr_tr: Yönetici güncelleme sırasında bir hata meydana geldi.

# ADMIN_UPDATE_SUCCESS
source: The admin has been successfully updated.
tr_tr: Yönetici başarıyla güncellendi.

# ADMIN_VALID_EMAIL_REQUIRED
source: A valid e-mail address must be entered.
tr_tr: Geçerli bir e-posta adresi girilmelidir.

# CATEGORY_CREATED_SUCCESS
source: Category has been created successfully.
tr_tr: Kategori oluşturuldu.

# CATEGORY_CREATE_FAILED
source: An error occurred while creating category.
tr_tr: Kategori oluşturulurken bir hata meydana geldi

# CATEGORY_DELETED_SUCCESS
source: Category has been deleted successfully.
tr_tr: Kategori başarıyla silindi.

# CATEGORY_DELETE_FAILED
source: An error occurred while deleting category.
tr_tr: Kategori silinirken bir hata meydana geldi

# CATEGORY_FOUND_SUCCESS
source: Category was succesfully found.
tr_tr: Aranan kategori bulundu.

# CATEGORY_GET_FAILED
source: The category could not be retrieved.
tr_tr: Kategori getirilemedi

# CATEGORY_LISTED_SUCCESS
source: The category list was successfully retrieved.
tr_tr: Kategoriler başarıyla listelendi.

# CATEGORY_LIST_EMPTY
source: The company list is empty.
tr_tr: Kategori listesi boş

# CATEGORY_LIST_FAILED
source: An error occurred while retrieving the category list.
tr_tr: Kategoriler getirilirken bir hata meydana geldi

# CATEGORY_MAX_LENGTH
source: Cannot exceed 128 characters
tr_tr: 128 karakterden fazla girilemez

# CATEGORY_MIN_LENGTH
source: Must be at least 2 characters long
tr_tr: En az 2 karakter girilmeli

# CATEGORY_NAMESPACE_IS_REQUIRED
source: This field cannot be empty
tr_tr: Bu alanın girilmesi zorunludur

# CATEGORY_NOT_FOUND
source: The category was not found.
tr_tr: Kategori bulunamadı.

# CATEGORY_UPDATED_FAILED
source: An error occurred while updatingg the category.
tr_tr: Kategori güncellenirken hata oluştu

# CATEGORY_UPDATED_SUCCESS
source: The category was successfully updated.
tr_tr: Kategori güncelleme başarılı.

# BRANCH_COMPANY_RELATION
source: Select a Company
tr_tr: Firma Seçiniz

# ADMIN_GETBYID_SUCCESS
source: Admin found successfully.
tr_tr: Yönetici başarılı bir şekilde listelendi

# PROMOTION_PRODUCT_RELATION
source: Please Select a Product!
tr_tr: Lütfen Promosyon uygulanacak ürünü seçiniz

# PROMOTION_END_DATE_GREATER_THAN_START_DATE
source: The promotion end date cannot be before the start date
tr_tr: Promosyon bitiş tarihi başlangıç tarihinden sonraki bir tarih olmalıdır

# PROMOTION_END_DATE_REQUIRED
source: Promotion end date is required!
tr_tr: Promosyon bitiş tarihi zorunludur

# PROMOTION_IS_ACTIVE_REQUIRED
source: Choose promotion activation!
tr_tr: Promosyon aktifliğini seçiniz

# PROMOTION_START_DATE_GREATER_THAN_TODAY
source: The promotion can start from today or any date thereafter
tr_tr: Promosyon bugünden önceki bir tarihte başlatılamaz

# PROMOTION_START_DATE_REQUIRED
source: Promotion start date is required!
tr_tr: Promosyon başlama tarihi zorunludur

source: Promotion start date less than end date!
tr_tr: Promosyon başlangıç tarihi , bitiş tarihinden önceki bir tarih olmalıdır

# PROMOTION_START_DATE_NOT_EQUAL_END_DATE
source: Promotion start and end date cannot be the same date!
tr_tr: Promosyon başlama ve bitiş tarihleri aynı tarih olamaz

# BRANCH_COMPANY_LISTED_DELETED
source: Company deleted
tr_tr: Firma Silinmiş

# COUNTRY_CREATE_ERROR
source: An error occured while creating country.
tr_tr: Ülke oluşturulurken bir hata meydana geldi.

# COUNTRY_CREATE_SUCCESS
source: The country was successfully created.
tr_tr: Ülke başarıyla oluşturuldu.

# COUNTRY_DELETE_ERROR
source: An error occurred while deleting the country.
tr_tr: Ülke silinirken bir hata meydana geldi.

# COUNTRY_DELETE_SUCCESS
source: The country was successfully deleted.
tr_tr: Ülke başarıyla silindi.

# COUNTRY_GETBYID_ERROR
source: Failed to Bring Country
tr_tr: Ülke getirilemedi.

# COUNTRY_GETBYID_SUCCESS
source: Country Has Been Brought Successfully
tr_tr: Ülke Getirme Başarılı.

# COUNTRY_LISTED_ERROR
source: An error occurred while listing countries.
tr_tr: Ülkeleri listelerken bir hata meydana geldi.

# COUNTRY_LISTED_NOTFOUND
source: Country Not Found.
tr_tr: Ülke bulunamadı.

# COUNTRY_LISTED_SUCCESS
source: Country Has Been Listed Successfully.
tr_tr: Ülke Listeleme Başarılı.

source: Country not found.
tr_tr: Ülke bulunamadı.

# COUNTRY_UPDATE_ERROR
source: An error occurred while updating the country
tr_tr: Ülke güncellenirken bir hata meydana geldi.

# COUNTRY_UPDATE_SUCCESS
source: The country was successfully updated
tr_tr: Ülke başarıyla güncellendi

# COUNTRY_NAME_MAXIMUM_LENGTH
source: Country name must be a maximum of 40 characters.
tr_tr: Ülke adı en fazla 40 karakter olmalı

# COUNTRY_NAME_MINIMUM_LENGTH
source: Must be at least 2 characters long
tr_tr: Ülke adı en az 2 karakter olmalı

# COUNTRY_NAME_NOT_EMPTY
source: Country Name field is required.
tr_tr: Ülke adı boş bırakılmamalı

source: Population must be greater than zero
tr_tr: Nüfus 0'dan büyük olmalıdır

# COUNTRY_POPULATİON_NOT_EMPTY
source: This field cannot be empty
tr_tr: Ülke nüfusu boş bırakılamaz

# ORDER_DISCOUNT_VALIDATION
source: Discount rate must be between 0 and 100.
tr_tr: İndirim oranı 0 ile 100 arasında olmalıdır.

# CITY_CREATED_ERROR
source: Error occurred while creating the city.
tr_tr: Şehir oluşturulurken hata oluştu.

# CITY_CREATED_SUCCESS
source: City created successfully.
tr_tr: Şehir başarıyla oluşturuldu.

# CITY_DELETED_ERROR
source: Error occurred while deleting the city.
tr_tr: Şehir silinirken hata oluştu.

# CITY_DELETED_SUCCESS
source: City deleted successfully.
tr_tr: Şehir başarıyla silindi.

# CITY_GET_SUCCESS
source: City retrieved successfully.
tr_tr: Şehir başarıyla getirildi.

# CITY_LISTED_EMPTY
source: No cities found to list.
tr_tr: Listelenecek şehir bulunamadı.

# CITY_LISTED_ERROR
source: Error occurred while listing the cities.
tr_tr: Şehirler listelenirken hata oluştu.

# CITY_LISTED_SUCCESS
source: Cities listed successfully.
tr_tr: Şehirler başarıyla listelendi.

source: City name cannot be empty.
tr_tr: Şehir adı boş olamaz.

# CITY_NAME_CANNOT_CONTAIN_NUMBER
source: City name cannot contain numbers.
tr_tr: Şehir adı rakam içeremez.

source: City not found.
tr_tr: Şehir bulunamadı.

# CITY_UPDATED_ERROR
source: Error occurred while updating the city.
tr_tr: Şehir güncellenirken hata oluştu.

# CITY_UPDATED_SUCCESS
source: City updated successfully.
tr_tr: Şehir başarıyla güncellendi.

# CANCEL_MANAGER
source: Cancel
tr_tr: İptal

# DELETE_CONFIRM_MANAGER
source: Are you sure you want to delete this manager?
tr_tr: Bu yöneticiyi silmek istediğinizden emin misiniz?

# DELETE_CONFIRM_TITLE_MANAGER
source: Delete Manager
tr_tr: Yöneticiyi Sil

# DELETE_MANAGER
source: Delete
tr_tr: Sil

# EMPLOYEE_COMPANY_REQUIRED
source: Please select a company.
tr_tr: Lütfen bir şirket seçiniz.

# PROMOTION_COMPANY_RELATION
source: Please select the promotion's company
tr_tr: Lütfen promosyonun hangi şirkete ait olduğunu belirtiniz

# PRODUCT_COMPANY_RELATION
source: Please select the product's company
tr_tr: Lütfen Ürünün Sirketini Seciniz

# CUSTOMER_COMPANY_RELATION
source: Please select a company for the customer.
tr_tr: Lütfen müşterinin hangi şirkete ait olduğunu seçiniz.

# PRODUCT_COMPANY_DELETED
source: Company Deleted!
tr_tr: Şirket Silinmiş

# STOCK_TYPE_SIZE_CREATED_SUCCESS
source: Stock Type Size created successfully.
tr_tr: Stok Tipi Boyutu başarıyla oluşturuldu.

# STOCK_TYPE_SIZE_CREATE_FAILED
source: Failed to create Stock Type Size.
tr_tr: Stok Tipi Boyutu oluşturulurken hata oluştu.

# STOCK_TYPE_SIZE_DELETED_SUCCESS
source: Stock Type Size deleted successfully.
tr_tr: Stok Tipi Boyutu başarıyla silindi.

# STOCK_TYPE_SIZE_DELETE_FAILED
source: Failed to delete Stock Type Size.
tr_tr: Stok Tipi Boyutu silinirken hata oluştu.

# STOCK_TYPE_SIZE_FOUND_SUCCESS
source: Stock Type Size found successfully.
tr_tr: Stok Tipi Boyutu başarıyla bulundu.

# STOCK_TYPE_SIZE_GET_FAILED
source: The stock type size could not be retrieved.
tr_tr: Stok Tipi Boyutu getirilirken hata oluştu.

# STOCK_TYPE_SIZE_LISTED_SUCCESS
source: Stock Type Sizes listed successfully.
tr_tr: Stok Tipi Boyutları başarıyla listelendi.

# STOCK_TYPE_SIZE_LIST_EMPTY
source: No Stock Type Sizes found to list.
tr_tr: Listelenecek Stok Tipi Boyutu bulunamadı.

# STOCK_TYPE_SIZE_LIST_FAILED
source: Failed to list Stock Type Sizes.
tr_tr: Stok Tipi Boyutları listelenirken hata oluştu.

# STOCK_TYPE_SIZE_MAX_LENGTH
source: The size field cannot exceed 128 characters
tr_tr: Boyut alanına 128 karakterden fazla girilemez.

# STOCK_TYPE_SIZE_MIN_LENGTH
source: The size field must be at least 1 characters long
tr_tr: En az 1 karakter girilmeli

# STOCK_TYPE_SIZE_NOT_EMPTY
source: The size field cannot be empty
tr_tr: Boyut alanı boş bırakılamaz

source: Stock Type Size not found.
tr_tr: Stok Tipi Boyutu bulunamadı.

# STOCK_TYPE_SIZE_UPDATE_FAILED
source: An error occurred while updating the stock type size.
tr_tr: Stok Tipi Boyutu güncellenirken hata oluştu.

# STOCK_TYPE_SIZE_UPDATE_SUCCESS
source: Stock Type Size updated successfully.
tr_tr: Stok Tipi Boyutu başarıyla güncellendi.

# PROMOTION_COMPANY_DELETED
source: Company deleted!
tr_tr: Şirket silinmiş

# PROMOTION_PRODUCT_DELETED
source: Product deleted!
tr_tr: Ürün silinmiş

# MANAGER_CREATED_SUCCESS
source: Manager created successfully.
tr_tr: Yönetici başarıyla oluşturuldu.

# MANAGER_CREATE_FAILED
source: An error occurred while creating the manager.
tr_tr: Yönetici oluşturulurken bir hata meydana geldi.

# MANAGER_DELETED_SUCCESS
source: Manager deleted successfully.
tr_tr: Yönetici başarıyla silindi.

# MANAGER_DELETE_FAILED
source: An error occurred while deleting the manager.
tr_tr: Yönetici silinirken bir hata meydana geldi.

# MANAGER_EMAIL_INVALID
source: Please enter a valid email address!
tr_tr: Geçerli bir email adresi giriniz

# MANAGER_EMAIL_NOT_EMPTY
source: Email cannot be empty!
tr_tr: Email alanı boş bırakılamaz

# MANAGER_FIRST_NAME_INVALID_CHARS
source: First name cannot contain special characters or numbers!
tr_tr: İsim özel karakter veya rakam içeremez

# MANAGER_FIRST_NAME_MAX_LENGTH
source: First name cannot exceed 128 characters!
tr_tr: İsim 128 karakterden fazla olamaz

# MANAGER_FIRST_NAME_MIN_LENGTH
source: First name must be at least 2 characters long!
tr_tr: İsim en az 2 karakter olmalıdır

# MANAGER_FIRST_NAME_NOT_EMPTY
source: First name cannot be empty!
tr_tr: İsim alanı boş bırakılamaz

# MANAGER_FOUND_SUCCESS
source: Manager found successfully.
tr_tr: Yönetici başarıyla bulundu.

# MANAGER_GET_FAILED
source: An error occurred while retrieving the manager data.
tr_tr: Yönetici verilerini alırken bir hata meydana geldi.

# MANAGER_LAST_NAME_INVALID_CHARS
source: Last name cannot contain special characters or numbers!
tr_tr: Soyisim özel karakter veya rakam içeremez

# MANAGER_LAST_NAME_MAX_LENGTH
source: Last name cannot exceed 128 characters!
tr_tr: Soyisim 128 karakterden fazla olamaz

# MANAGER_LAST_NAME_MIN_LENGTH
source: Last name must be at least 2 characters long!
tr_tr: Soyisim en az 2 karakter olmalıdır

# MANAGER_LAST_NAME_NOT_EMPTY
source: Last name cannot be empty!
tr_tr: Soyisim alanı boş bırakılamaz

# MANAGER_LISTED_SUCCESS
source: Managers listed successfully.
tr_tr: Yöneticiler başarıyla listelendi.

# MANAGER_LIST_EMPTY
source: Manager list is empty.
tr_tr: Yönetici listesi boş.

# MANAGER_LIST_FAILED
source: An error occurred while listing the managers.
tr_tr: Yöneticiler listelenirken bir hata meydana geldi.

source: Manager not found.
tr_tr: Yönetici bulunamadı.

# MANAGER_UPDATE_FAILED
source: An error occurred while updating the manager.
tr_tr: Yönetici güncellenirken bir hata meydana geldi.

# MANAGER_UPDATE_SUCCESS
source: Manager updated successfully.
tr_tr: Yönetici başarıyla güncellendi.

# EMPLOYEE_TURKISH_CHAR
source: The entered information must not contain Turkish characters (ç,ı,ğ,ö,ş,ü,Ç,İ,Ğ,Ö,Ş,Ü).
tr_tr: Girilen Bilgiler Türkçe karakter(ç,ı,ğ,ö,ş,ü,Ç,İ,Ğ,Ö,Ş,Ü) içermemelidir.

source: Country name must be unique.
tr_tr: Ülke ismi benzersiz olmalıdır

source: City name must be unique
tr_tr: Şehir ismi benzersiz olmalıdır

# COUNTRY_NAME_SHOULD_BE_STRING
source: Country name must be string
tr_tr: Ülke ismi metin olmalıdır
