Repository: sinemgungor/BaSalesManagementApp
Catalog: BaSalesManagementApp.MVC/Resources/Resource.*.resx
Languages: tr_tr

source: Product Name
tr_tr: Ürün Adı

source: About Us
tr_tr: Hakkımızda

# AccessDeniedMessage
source: You do not have permission to access this page.
tr_tr: Bu sayfaya erişim yetkiniz bulunmamaktadır.

# AccessDeniedTitle
source: Access Denied
tr_tr: Erişim Engellendi

source: Actions
tr_tr: Hareketler

source: Active
tr_tr: Aktif

source: Add
tr_tr: Ekle

source: Added By
tr_tr: Tarafından Eklendi

source: Address
tr_tr: Adres

source: Admin
tr_tr: Yönetici

source: Admin Index
tr_tr: Yönetici Listesi

source: Admin Name
tr_tr: Yönetici Adı

source: Admins
tr_tr: Yöneticiler

source: Age
tr_tr: Yaş

source: Analytics
tr_tr: Analitik

source: Back to List
tr_tr: Listeye Geri Dön

# BackToPreviousPage
source: Click to go back to the previous page
tr_tr: Bir önceki sayfaya dönmek için tıklayınız

source: Basic
tr_tr: Temel

source: Bilge Adam Academy
tr_tr: Bilge Adam Akademi

source: Bilge Adam Technology
tr_tr: Bilge Adam Teknoloji

source: Branch
tr_tr: Şube

source: Branch Details
tr_tr: Şube Detayları

source: Branch Index
tr_tr: Şube Listesi

source: Branch Name
tr_tr: Şube Adı

source: building Web apps with ASP.NET Core
tr_tr: ASP.NET Core ile Web uygulamaları oluşturma

# CANCEL_ADMIN
source: Cancel
tr_tr: İptal

# CANCEL_BRANCH
source: Cancel
tr_tr: İptal

# CANCEL_CATEGORY
source: Cancel
tr_tr: İptal

# CANCEL_CITY
source: Cancel
tr_tr: İptal

# CANCEL_COMPANY
source: Cancel
tr_tr: İptal

# CANCEL_COUNTRY
source: Cancel
tr_tr: İptal

# CANCEL_CUSTOMER
source: Cancel
tr_tr: İptal

# CANCEL_EMPLOYEE
source: Cancel
tr_tr: İptal

# CANCEL_ORDER
source: Cancel
tr_tr: İptal

# CANCEL_PRODUCT
source: Cancel
tr_tr: İptal

# CANCEL_PRODUCT_TYPE
source: Cancel
tr_tr: İptal

# CANCEL_PROMOTION
source: Cancel
tr_tr: İptal

# CANCEL_STOCK
source: Cancel
tr_tr: İptal

source: Cancel Stock Type Size
tr_tr: İptal

# CANCEL_WAREHOUSE
source: Cancel
tr_tr: İptal

source: Category
tr_tr: Kategori

source: Category Details
tr_tr: Kategori Detayları

source: Category Index
tr_tr: Kategori Listesi

source: Category Name
tr_tr: Kategori Adı

source: Change Your Password
tr_tr: Şifrenizi Değiştirin

source: Change My Password
tr_tr: Şifremi Değiştir

source: Change Password
tr_tr: Şifre Değiştir

# ChangePasswordButton
source: Change Password
tr_tr: Şifre Değiştir

source: City
tr_tr: Şehir

source: Close
tr_tr: Kapat

source: Company
tr_tr: Şirket

source: Company Address
tr_tr: Şirket Adresi

source: Company Details
tr_tr: Şirket Detayları

source: Company Index
tr_tr: Şirket Listesi

source: Company Name
tr_tr: Şirket Adı

source: Company Phone
tr_tr: Şirket Telefonu

source: Confirm New Password
tr_tr: Yeni Şifreyi Onayla

# ConfirmNewPasswordPlaceholder
source: Confirm your new password
tr_tr: Yeni şifrenizi onaylayın

# ContactAdmin
source: Please contact the system administrator for necessary permissions.
tr_tr: Lütfen gerekli izinler için sistem yöneticisi ile iletişime geçin.

source: Count
tr_tr: Miktar

source: Country
tr_tr: Ülke

source: Country Details
tr_tr: Ülke Detayları

source: Country Index
tr_tr: Ülke Listesi

source: Country Name
tr_tr: Ülke Adı

source: Create
tr_tr: Oluştur

source: Create Employee
tr_tr: Çalışan Oluştur

source: Create New
tr_tr: Yeni Oluştur

source: Create Admin
tr_tr: Yönetici Oluştur

source: Created Date
tr_tr: Oluşturulma Tarihi

source: Current Password
tr_tr: Mevcut Şifre

# CurrentPasswordPlaceholder
source: Enter your current password
tr_tr: Mevcut Şifrenizi Girin

source: Customer
tr_tr: Müşteri

source: Dashboard
tr_tr: Gösterge Paneli

source: Dashboards
tr_tr: Gösterge Tabloları

source: Date
tr_tr: Tarih

source: Default Profile Photo
tr_tr: Varsayılan Profil Fotoğrafı

source: Delete
tr_tr: Sil

# DELETE_ADMIN
source: Delete
tr_tr: Sil

# DELETE_BRANCH
source: Delete
tr_tr: Sil

# DELETE_CATEGORY
source: Delete
tr_tr: Sil

# DELETE_CITY
source: Delete
tr_tr: Sil

# DELETE_COMPANY
source: Delete
tr_tr: Sil

# DELETE_CONFIRM_ADMIN
source: Are you sure you want to delete this admin?
tr_tr: Bu admini silmek istediğinizden emin misiniz?

# DELETE_CONFIRM_BRANCH
source: Are you sure you want to delete this branch?
tr_tr: Bu şubeyi silmek istediğinizden emin misiniz?

# DELETE_CONFIRM_CATEGORY
source: Are you sure you want to delete this category?
tr_tr: Bu kategoriyi silmek istediğinizden emin misiniz?

# DELETE_CONFIRM_CITY
source: Are you sure want to delete this city?
tr_tr: Bu şehri silmek istediğinizden emin misiniz?

# DELETE_CONFIRM_COMPANY
source: Are you sure you want to delete this company?
tr_tr: Bu şirketi silmek istediğinizden emin misiniz?

# DELETE_CONFIRM_COUNTRY
source: Are you sure you want to delete this country?
tr_tr: Bu ülkeyi silmek istediğinizden emin misiniz?

# DELETE_CONFIRM_CUSTOMER
source: Are you sure you want to delete this customer?
tr_tr: Bu müşteriyi silmek istediğinizden emin misiniz?

# DELETE_CONFIRM_EMPLOYEE
source: Are you sure you want to delete this employee?
tr_tr: Bu çalışanı silmek istediğinizden emin misiniz?

# DELETE_CONFIRM_ORDER
source: Are you sure you want to delete this order?
tr_tr: Bu siparişi silmek istediğinizden emin misiniz?

# DELETE_CONFIRM_PRODUCT
source: Are you sure you want to delete this product?
tr_tr: Bu ürünü silmek istediğinizden emin misiniz?

# DELETE_CONFIRM_PRODUCT_TYPE
source: Are you sure you want to delete this product type?
tr_tr: Bu ürün türünü silmek istediğinizden emin misiniz?

# DELETE_CONFIRM_PROMOTION
source: Are you sure you want to delete this promotion?
tr_tr: Bu promosyonu silmek istediğinizden emin misiniz?

# DELETE_CONFIRM_STOCK
source: Are you sure you want to delete this stock?
tr_tr: Bu stoğu silmek istediğinizden emin misiniz?

# DELETE_CONFIRM_STOCK_TYPE_SIZE
source: Are you sure you want to delete this stock type size?
tr_tr: Bu stok türünün boyutunu silmek istediğinizden emin misiniz?

# DELETE_CONFIRM_TITLE_ADMIN
source: Delete Admin
tr_tr: Admini Sil

# DELETE_CONFIRM_TITLE_BRANCH
source: Delete Branch
tr_tr: Şubeyi Sil

# DELETE_CONFIRM_TITLE_CATEGORY
source: Delete Category
tr_tr: Kategoriyi Sil

# DELETE_CONFIRM_TITLE_CITY
source: Delete City
tr_tr: Şehri Sil

# DELETE_CONFIRM_TITLE_COMPANY
source: Delete Company
tr_tr: Şirketi Sil

# DELETE_CONFIRM_TITLE_COUNTRY
source: Delete Country
tr_tr: Ülkeyi Sil

# DELETE_CONFIRM_TITLE_CUSTOMER
source: Delete Customer
tr_tr: Müşteriyi Sil

# DELETE_CONFIRM_TITLE_EMPLOYEE
source: Delete Employee
tr_tr: Çalışanı Sil

# DELETE_CONFIRM_TITLE_ORDER
source: Delete Order
tr_tr: Siparişi Sil

# DELETE_CONFIRM_TITLE_PRODUCT
source: Delete Product
tr_tr: Ürünü Sil

# DELETE_CONFIRM_TITLE_PRODUCT_TYPE
source: Delete Product Type
tr_tr: Ürün Türünü Sil

# DELETE_CONFIRM_TITLE_PROMOTION
source: Delete Promotion
tr_tr: Promosyonu Sil

# DELETE_CONFIRM_TITLE_STOCK
source: Delete Stock
tr_tr: Stoğu Sil

# DELETE_CONFIRM_TITLE_STOCK_TYPE_SIZE
source: Delete Stock Type Size
tr_tr: Stok türü Boyutunu Sil

# DELETE_CONFIRM_TITLE_WAREHOUSE
source: Delete Warehouse
tr_tr: Depoyu Sil

# DELETE_CONFIRM_WAREHOUSE
source: Are you sure you want to delete this warehouse?
tr_tr: Bu depoyu silmek istediğinizden emin misiniz?

# DELETE_COUNTRY
source: Delete
tr_tr: Sil

# DELETE_CUSTOMER
source: Delete
tr_tr: Sil

# DELETE_EMPLOYEE
source: Delete
tr_tr: Sil

# DELETE_ORDER
source: Delete
tr_tr: Sil

# DELETE_PRODUCT
source: Delete
tr_tr: Sil

# DELETE_PRODUCT_TYPE
source: Delete
tr_tr: Sil

# DELETE_PROMOTION
source: Delete
tr_tr: Sil

# DELETE_STOCK
source: Delete
tr_tr: Sil

source: Delete Stock Type Size
tr_tr: Sil

# DELETE_WAREHOUSE
source: Delete
tr_tr: Sil

source: Description
tr_tr: Açıklama

source: Details
tr_tr: Detaylar

source: Disabled Selected
tr_tr: Devre Dışı Seçildi

source: Discount
tr_tr: İndirim

source: Edit Profile
tr_tr: Profili Güncelle

source: Education Solutions
tr_tr: Eğitim Çözümleri

source: Email
tr_tr: Mail Adresi

source: Employee
tr_tr: Çalışan

source: Employee Details
tr_tr: Çalışan Detayları

source: End Date
tr_tr: Bitiş Tarihi

source: Enter your Email
tr_tr: Mail Adresinizi Giriniz

source: Error Page
tr_tr: Hata Sayfası

source: First
tr_tr: Birinci

source: First Name
tr_tr: Adı

source: Home Page
tr_tr: Anasayfa

source: Id
tr_tr: Kimlik

source: Index
tr_tr: Liste

source: Is Active
tr_tr: Aktif

# isCompanyActive
source: Company Status
tr_tr: Firma Durumu

source: Languages
tr_tr: Diller

source: Last
tr_tr: Sonuncu

source: Last Name
tr_tr: Soyadı

source: Learn About
tr_tr: Hakkında bilgi al

source: License
tr_tr: Lisans

source: List
tr_tr: Liste

source: Log Out
tr_tr: Çıkış

source: Login
tr_tr: Giriş

source: Made with
tr_tr: Yılında Yapılmıştır

source: Management
tr_tr: Yönetimi

source: My Profile
tr_tr: Profilim

source: Customer Name
tr_tr: Müşteri Adı

source: Newest First
tr_tr: En Yeniler Önce

source: New Password
tr_tr: Yeni Şifre

# NewPasswordPlaceholder
source: Enter your new password
tr_tr: Yeni Şifrenizi Girin

source: Next
tr_tr: Sonraki

source: No Company Found
tr_tr: Ülke Bulunamadı

source: No Products Available
tr_tr: Mevcut Ürün Yok

source: Oldest First
tr_tr: En Eskiler Önce

source: Operations
tr_tr: İşlemler

source: Order
tr_tr: Sipariş

source: Order Date
tr_tr: Şipariş Tarihi

source: Order Details
tr_tr: Sipariş Detayları

source: Order Index
tr_tr: Şipariş Listesi

source: PAGES
tr_tr: SAYFALAR

# Pagess
source: Pages
tr_tr: Sayfalar

source: Password
tr_tr: Şifre

# PasswordRequirementLength
source: At least 8 characters
tr_tr: En az 8 karakter

# PasswordRequirementNumber
source: At least one number
tr_tr: En az bir sayı

# PasswordRequirementSpecial
source: At least one special character
tr_tr: En az bir özel karakter

# PasswordRequirementUppercase
source: At least one uppercase letter
tr_tr: En az bir büyük harf

source: Phone
tr_tr: Telefon

source: Photo
tr_tr: Fotoğraf

source: Please Choose Company First
tr_tr: Lütfen Önce Şirketi Seçin

source: Population
tr_tr: Popülasyon

source: Previous
tr_tr: Öncesi

source: Price
tr_tr: Fiyat

source: Privacy Policy
tr_tr: Gizlilik Politikası

source: Pro
tr_tr: Profesyonel

source: Product
tr_tr: Ürün

source: Product Name
tr_tr: Ürün Adı

source: Product Type Name
tr_tr: Ürün Tipi Adı

source: Product Type Details
tr_tr: Ürün Tipi Detayları

source: Product Type List
tr_tr: Ürün Tipi Listesi

source: Profile
tr_tr: Profil

source: Profile Photo
tr_tr: Profil Fotoğrafı

source: Promotion
tr_tr: Promosyon

source: Promotion Index
tr_tr: Promosyon Listesi

source: Promotion Details
tr_tr: Promosyon Detayları

source: QR Code
tr_tr: QR Kod

source: Quantity
tr_tr: Miktar

source: Role
tr_tr: Rol

source: Sales
tr_tr: Satış

source: Sales Management
tr_tr: Satış Yönetimi

source: Save
tr_tr: Kaydet

source: Search...
tr_tr: Ara...

source: Select a Product
tr_tr: Bir Ürün Seçiniz

source: Select Company
tr_tr: Şirket Seçiniz

source: Select Branch
tr_tr: Şube Seçiniz

source: Select Company
tr_tr: Şirket Seçiniz

source: Select Country
tr_tr: Ülke Seç

source: Server Error (500)
tr_tr: Sunucu Hatası (500)

# ServerErrorMessage
source: An error occurred
tr_tr: Bir Hata Oluştu

source: Sign in
tr_tr: Oturum Açın

source: Size
tr_tr: Boyut

source: Start Date
tr_tr: Başlangıç Tarihi

source: Stock
tr_tr: Stok

source: Stock Index
tr_tr: Stok Listesi

source: Stock Type Size
tr_tr: Stok Birim Miktarı

source: Student CreateVM
tr_tr: ÖgrenciVM Oluştur

source: Support
tr_tr: Destek

source: Template
tr_tr: Şablon

source: Title
tr_tr: Ünvan

source: Total Price
tr_tr: Toplam Fiyat

source: Update
tr_tr: Güncelle

source: User Photo
tr_tr: Kullanıcı Fotoğrafı

source: Warehouse
tr_tr: Depo

source: Warehouse Index
tr_tr: Depo Listesi

source: Welcome
tr_tr: Hoşgeldiniz

source: Welcome to Sales Management
tr_tr: Satış Yönetimine Hoşgeldiniz

# WelcomeMessage
source: Welcome to Sales Management
tr_tr: Satış Yönetimi'ne Hoş Geldiniz

# ORDER_CREATED_SUCCESS
source: The order has been created successfully.
tr_tr: Sipariş başarıyla oluşturuldu.

# ORDER_CREATE_FAILED
source: An error occurred while creating the order.
tr_tr: Sipariş oluşturulurken bir hata meydana geldi.

# ORDER_DATE_VALIDATION
source: Date cannot be earlier than today.
tr_tr: Tarih bugünden daha önce olamaz.

# ORDER_DELETED_SUCCESS
source: The order has been deleted successfully.
tr_tr: Sipariş başarıyla silindi.

# ORDER_DELETE_FAILED
source: An error occurred while deleting the order.
tr_tr: Sipariş silinirken bir hata meydana geldi.

# ORDER_EMPTY_VALIDATION
source: This field cannot be empty.
tr_tr: Bu alan boş olamaz.

# ORDER_FOUND_SUCCESS
source: The order was found successfully.
tr_tr: Sipariş başarıyla bulundu.

# ORDER_GET_FAILED
source: An error occurred while retrieving order data.
tr_tr: Sipariş verilerini alırken bir hata meydana geldi.

# ORDER_LISTED_SUCCESS
source: Orders have been listed successfully.
tr_tr: Siparişler başarıyla listelendi.

# ORDER_LIST_EMPTY
source: Order list is empty.
tr_tr: Sipariş listesi boş.

# ORDER_LIST_FAILED
source: An error occurred while listing orders.
tr_tr: Siparişleri listelerken bir hata meydana geldi.

source: Order not found.
tr_tr: Sipariş bulunamadı.

# ORDER_PRECISION_VALIDATION
source: Discount can be up to 2 decimal places.
tr_tr: İndirim en fazla 2 ondalık basamaklı olabilir.

# ORDER_QUANTITY_VALIDATION
source: Order quantity must be at least 1, maximum 999999.
tr_tr: Sipariş miktarı en az 1, en fazla 999999 olmalıdır.

# ORDER_TOTALPRICE_VALIDATION
source: The total price must be greater than zero.
tr_tr: Toplam fiyat sıfırdan büyük olmalıdır.

source: Order update failed.
tr_tr: Sipariş güncelleme başarısız.

# ORDER_UPDATE_SUCCES
source: Order update successful.
tr_tr: Sipariş güncelleme başarılı.

# ORDER_WHOLE_NUMBER_VALIDATION
source: Quantity must be a whole number.
tr_tr: Miktar tam sayı olmalıdır.

# COMPANY_ADDRESS_MAXIMUM_LENGTH
source: More than 128 characters cannot be entered in the company address
tr_tr: Firma adresine 128 karakterden fazla girilemez

# COMPANY_ADDRESS_MINIMUM_LENGTH
source: At least 2 characters must be entered in the company address
tr_tr: Firma adresine en az 2 karakter girilmeli

# COMPANY_ADDRESS_NOT_EMPTY
source: Company address cannot be null
tr_tr: Firma Adresi Boş Bırakılamaz.

# COMPANY_ADD_ERROR
source: Company Could Not Be Added
tr_tr: Firma Ekleme Başarısız.

# COMPANY_ADD_SUCCESS
source: Company Has Been Added Successfully
tr_tr: Firma Ekleme Başarılı.

# COMPANY_DELETE_ERROR
source: Company Could Not Be Deleted
tr_tr: Firma Silme Başarısız.

# COMPANY_DELETE_SUCCESS
source: Company Has Been Deleted Successfully
tr_tr: Firma Silme Başarılı.

# COMPANY_GETBYID_ERROR
source: Failed to Bring Company
tr_tr: Firma Getirme Başarısız.

# COMPANY_GETBYID_SUCCESS
source: Company Has Been Brought Successfully
tr_tr: Firma Getirme Başarılı.

# COMPANY_LISTED_ERROR
source: Company Not Listed
tr_tr: Firma Listeleme Başarısız.

# COMPANY_LISTED_NOTFOUND
source: Company Not Found
tr_tr: Firma Bulunamadı.

# COMPANY_LISTED_SUCCESS
source: Company Has Been Listed Successfully
tr_tr: Firma Listeleme Başarılı.

# COMPANY_MATCHES
source: Invalid company phone
tr_tr: Geçersiz firma telefonu

# COMPANY_NAME_MAXIMUM_LENGTH
source: More than 128 characters cannot be entered in the company name
tr_tr: Firma adına 128 karakterden fazla girilemez

# COMPANY_NAME_MINIMUM_LENGTH
source: At least 2 characters must be entered in the company name
tr_tr: Firma adına en az 2 karakter girilmeli

# COMPANY_NAME_NOT_EMPTY
source: Company name cannot be empty
tr_tr: Firma Adı Boş Bırakılamaz.

# COMPANY_PHONE_MAXIMUM_LENGTH
source: More than 40 numbers cannot be entered in the company phone
tr_tr: Firma telefonuna 40 rakamdan fazla girilemez

# COMPANY_PHONE_MINIMUM_LENGTH
source: At least 10 characters must be entered in the company phone
tr_tr: Firma telefonuna en az 10 rakam girilmeli

# COMPANY_PHONE_NOT_EMPTY
source: Company phone cannot be null
tr_tr: Firma Telefonu Boş Bırakılamaz.

# COMPANY_UPDATE_ERROR
source: Company Could Not Be Updated
tr_tr: Firma Güncelleme Başarısız.

# COMPANY_UPDATE_SUCCESS
source: Company Has Been Updated Successfully
tr_tr: Firma Güncelleme Başarılı.

# ACCOUNT_NOT_FOUND
source: Email address or password is in correct !
tr_tr: Email adresi ya da şifre hatalı

# ACCOUNT_ROLE_NOT_FOUND_FOR_USER
source: Role was not found for user !
tr_tr: Kullanıcı için rol bulunamadı

# PLEASE_ENTER_YOUR_EMAIL
source: Please enter your email address
tr_tr: Lütfen email adresinizi giriniz

source: Please enter your email with correct format
tr_tr: Lütfen mail adresinizi doğru formatta giriniz

source: Please enter your password
tr_tr: Lütfen şifrenizi giriniz

# CUSTOMER_ADD_ERROR
source: Customer Could Not Be Added.
tr_tr: Müşteri Ekleme Başarısız.

# CUSTOMER_ADD_SUCCESS
source: Customer Has Been Added Successfully.
tr_tr: Müşteri Ekleme Başarılı.

# CUSTOMER_DELETE_ERROR
source: Customer Could Not Be Deleted.
tr_tr: Müşteri Silme Başarısız.

# CUSTOMER_DELETE_SUCCESS
source: Customer Has Been Deleted Successfully.
tr_tr: Müşteri Silme Başarılı.

# CUSTOMER_FOUND_SUCCESS
source: Customer Found Successfully.
tr_tr: Aranan Müşteri Bulundu.

source: Customer Get Failed.
tr_tr: Müşteri Çekme Başarısız.

# CUSTOMER_LISTED_ERROR
source: Customer Could Not Be Listed.
tr_tr: Müşteri Listeleme Başarısız.

# CUSTOMER_LISTED_SUCCESS
source: Customers Has Been Listed Successfully.
tr_tr: Müşteri Listeleme Başarılı.

source: Customer List Empty.
tr_tr: Müşteri Listesi Boş.

source: Customer List Failed.
tr_tr: Müşteri Listeleme Başarısız.

source: Customer Not Found.
tr_tr: Müşteri Bulunamadı.

# CUSTOMER_UPDATED_FAILED
source: Customer Update Failed.
tr_tr: Müşteri Güncelleme Başarısız.

# CUSTOMER_UPDATED_SUCCESS
source: Customer Updated Successfully.
tr_tr: Müşteri Güncelleme Başarılı.

# STOCK_CREATED_SUCCESS
source: Stock has been created successfully.
tr_tr: Stok başarıyla oluşturuldu.

# STOCK_CREATE_FAILED
source: An error occured while creating stock.
tr_tr: Stok oluşturulurken bir hata meydana geldi.

# STOCK_DELETED_SUCCESS
source: Stock has been deleted successfully.
tr_tr: Stok başarıyla silindi.

# STOCK_DELETE_FAILED
source: An error occurred while deleting stock.
tr_tr: Stok silinirken bir hata meydana geldi.

# STOCK_EMPTY_VALIDATION
source: Count field cannot be empty.
tr_tr: Miktar alanı boş bırakılamaz.

# STOCK_FOUND_SUCCESS
source: Stock was found successfully.
tr_tr: Stok başarıyla bulundu.

# STOCK_GET_FAILED
source: An error occurred while retrieving amount of stock.
tr_tr: Stok verilerini alırken bir hata meydana geldi.

# STOCK_LISTED_SUCCESS
source: Stocks have been listed successfully.
tr_tr: Stoklar başarıyla listelendi.

# STOCK_LIST_EMPTY
source: Stock list is empty.
tr_tr: Stok listesi boş.

# STOCK_LIST_FAILED
source: An error occurred while listing stocks.
tr_tr: Stokları listelerken bir hata meydana geldi.

source: Stock not found.
tr_tr: Stok bulunamadı.

# STOCK_POSITIVE_VALIDATION
source: Count cannot be less than zero.
tr_tr: Stok miktarı sıfırdan küçük olamaz.

source: Stock update failed.
tr_tr: Stok Güncelleme Başarısız.

# STOCK_UPDATE_SUCCESS
source: Stock update successful.
tr_tr: Stok Güncelleme Başarılı.

# STOCK_WHOLENUMBER_VALIDATION
source: Count must be a whole number.
tr_tr: Stok miktarı tam sayı olmalıdır.

# EMPLOYEE_ADD_ERROR
source: An error occurred while adding an employee.
tr_tr: Çalışan ekleme sırasında bir hata oluştu.

# EMPLOYEE_ADD_SUCCESS
source: The employee has been added successfully.
tr_tr: Çalışan başarıyla eklendi.

# EMPLOYEE_DELETE_ERROR
source: An error occurred while deleting a worker.
tr_tr: Çalışan silme sırasında bir hata oluştu.

# EMPLOYEE_DELETE_SUCCESS
source: The employee has been deleted successfully.
tr_tr: Çalışan başarıyla silindi.

# EMPLOYEE_EMAIL_IN_USE
source: This email address is already in use.
tr_tr: Bu e-posta adresi zaten kullanılıyor.

# EMPLOYEE_E_MAIL_FIELD_IS_REQUIRED
source: Email field is required.
tr_tr: E-posta alanı zorunludur.

# EMPLOYEE_GETBYID_ERROR
source: No employee found.
tr_tr: Çalışan bulunamadı.

# EMPLOYEE_LISTED_ERROR
source: An error occurred while listing employees.
tr_tr: Çalışan listeleme sırasında bir hata oluştu.

# EMPLOYEE_LISTED_NOTFOUND
source: No employees were found.
tr_tr: Hiçbir çalışan bulunamadı.

# EMPLOYEE_LISTED_SUCCESS
source: Employees have been listed successfully.
tr_tr: Çalışanlar başarıyla listelendi.

# EMPLOYEE_NAMESPACE_IS_REQUIRED
source: Name field is required.
tr_tr: Ad alanı zorunludur.

# EMPLOYEE_NAME_MAX_LENGTH_ERROR
source: The name cannot be longer than 50 characters.
tr_tr: İsim 50 karakterden uzun olamaz.

# EMPLOYEE_NAME_MIN_LENGTH_ERROR
source: The name cannot be less than 2 characters.
tr_tr: İsim 2 karakterden az olamaz.

# EMPLOYEE_NAME_NUMERIC_FORBIDDEN
source: Numeric characters cannot be used in the name.
tr_tr: İsimde sayısal karakter kullanılamaz.

# EMPLOYEE_PHOTO_SIZE_EXCEEDS_LIMIT
source: Photo size cannot exceed 500 KB.
tr_tr: Fotoğraf boyutu 500 KB'dan fazla olamaz.

# EMPLOYEE_SURNAME_FIELD_IS_REQUIRED
source: The Surname field is required.
tr_tr: Soyad alanı zorunludur.

# EMPLOYEE_SURNAME_MAX_LENGTH_ERROR
source: Surname cannot be longer than 50 characters.
tr_tr: Soyisim 50 karakterden uzun olamaz.

# EMPLOYEE_SURNAME_MIN_LENGTH_ERROR
source: Surname cannot be less than 2 characters.
tr_tr: Soyisim 2 karakterden az olamaz.

# EMPLOYEE_SURNAME_NUMERIC_FORBIDDEN
source: Numeric characters cannot be used in the surname.
tr_tr: Soyisimde sayısal karakter kullanılamaz.

# EMPLOYEE_UPDATE_ERROR
source: An error occurred while the update was running.
tr_tr: Çalışan güncelleme sırasında bir hata oluştu.

# EMPLOYEE_UPDATE_SUCCESS
source: The employee has been updated successfully.
tr_tr: Çalışan başarıyla güncellendi.

# EMPLOYEE_VALID_EMAIL_REQUIRED
source: You entered an invalid email. For example: (orn@domainname.com)
tr_tr: Geçersiz Email girdiniz. Örn: (orn@alanadı.com)

# PROMOTION_CREATE_ERROR
source: An error occurred while creating the promotion.
tr_tr: Promosyon oluştururken bir hata meydana geldi.

# PROMOTION_CREATE_SUCCESS
source: The promotion has been created successfully.
tr_tr: Promosyon başarıyla oluşturuldu.

# PROMOTION_DELETE_ERROR
source: Promotion Could not Be Deleted.
tr_tr: Promosyon Silme Başarısız.

# PROMOTION_DELETE_SUCCESS
source: Promotion Has Been Deleted Successfully.
tr_tr: Promosyon Başarıyla Silindi.

# PROMOTION_DISCOUNT_GREATER_THAN_ZERO
source: Promotion discount must be greater than zero.
tr_tr: Promosyon indirimi sıfırdan büyük olmalıdır.

# PROMOTION_DISCOUNT_LESS_THAN_HUNDRED
source: Promotion discount should be less than 100.
tr_tr: Promosyon indirimi 100'den küçük olmalıdır.

# PROMOTION_DISCOUNT_REQUIRED
source: Promotion discount is required.
tr_tr: Promosyon indirimi zorunludur.

# PROMOTION_GETBYID_ERROR
source: An error occurred while retrieving promotion data.
tr_tr: Promosyon Getirme Başarısız.

# PROMOTION_GETBYID_SUCCESS
source: The promotion was found successfully.
tr_tr: Promosyon Getirme Başarılı.

# PROMOTION_LISTED_ERROR
source: An error occurred while listing promotions
tr_tr: Promosyon Listeleme Başarısız.

# PROMOTION_LISTED_NOTFOUND
source: Promotion list not found.
tr_tr: Görüntülenecek bir promosyon bulunmuyor.

# PROMOTION_LISTED_SUCCESS
source: Promotions Has Been Listed Successfully.
tr_tr: Promosyon Listeleme Başarılı.

source: Promotion Not Found.
tr_tr: Promosyon Bulunamadı.

# PROMOTION_PRICE_GREATER_THAN_ZERO
source: Promotion price must be greater than zero.
tr_tr: Promosyon fiyatı sıfırdan büyük olmalıdır.

# PROMOTION_PRICE_REQUIRED
source: Promotion price is required.
tr_tr: Promosyon fiyatı zorunludur.

# PROMOTION_TOTAL_PRICE_GREATER_THAN_OR_EQUAL_PRICE
source: Promotion total price should be small than or equal to the price.
tr_tr: Promosyon Toplam fiyatı , fiyattan küçük veya eşit olmalıdır.
