Repository: sinemgungor/BaSalesManagementApp
Catalog: BaSalesManagementApp.MVC/Resources/Resource.*.resx
Languages: tr_tr

# CHANGE_PASSWORD_ERROR
source: Password change failed
tr_tr: Şifre değiştirilirken hata meydana geldi

# CHANGE_PASSWORD_SUCCESS
source: Password change success
tr_tr: Şifre başarıyla değişirildi

source: Stock Type Size Index
tr_tr: Stok Tipi Boyut Listesi

source: Update Employee
tr_tr: Çalışanı Güncelle

source: The information entered is not valid.
tr_tr: Girilen bilgiler geçerli değil.

source: An error occurred while updating the profile
tr_tr: Profil güncellenirken bir hata oluştu

# Kategorileri_getirirken_bir_hata_meydana_geldi
source: An error occurred while fetching categories
tr_tr: Kategorileri getirirken bir hata meydana geldi

source: No photo selected and no existing photo found.
tr_tr: Hiçbir fotoğraf seçilmedi ve mevcut bir fotoğraf bulunamadı.

source: Profile updated successfully.
tr_tr: Profil başarıyla güncellendi.

# Şehirleri_getirirken_bir_hata_meydana_geldi
source: An error occurred while fetching cities
tr_tr: Şehirleri getirirken bir hata meydana geldi

source: Customer and Location
tr_tr: Müşteri ve Konum

source: Sales and Marketing
tr_tr: Satış ve Pazarlama

# PRODUCT_CANNOT_DELETE_IS_IN_ORDER
source: The product you want to delete is linked to an order. Would you like to make the product Inactive?
tr_tr: Silmek istediğiniz ürün bir siparişe bağlı. Ürünü Pasif durumuna almak ister misiniz?

# PRODUCT_PASSIVED_SUCCESS
source: Product passived successfully
tr_tr: Ürün başarıyla pasif duruma getirildi

source: Passive Product
tr_tr: Ürünü Pasif Yap

# Managementt
source: Management
tr_tr: Yönetim

source: No matching results
tr_tr: Eşleşen sonuç yok

source: Select Country
tr_tr: Ülke Seçiniz

# EMPLOYEE_INVALID_EMAIL_DOMAIN
source: Email field must be in appropriate format
tr_tr: E-posta alanı uygun formatta olmalıdır

# PRODUCT_CATEGORY_RELATION
source: Please select the product's category
tr_tr: Lütfen Ürünün Kategorisini Seciniz

# PRODUCT_PRICE_CANNOT_BE_EMPTY
source: This Field Cannot be Empty!
tr_tr: Bu Alan Boş Bırakılamaz

source: Select Category
tr_tr: Kategori Seciniz

source: Manager
tr_tr: Yönetici

source: City Name
tr_tr: Şehir Adı

source: Customer Details
tr_tr: Müşteri Detayları

# CUSTOMER_CITY_RELATION
source: Please select a city for the customer
tr_tr: Lütfen müşterinin hangi şehirde olduğunu seçiniz.

# CUSTOMER_COUNTRY_RELATION
source: Please select a country for the customer
tr_tr: Lütfen müşterinin hangi ülkede olduğunu seçiniz.

source: Select City
tr_tr: Şehir Seç

# COMPANY_CANNOT_DELETE_IS_IN_ORDER
source: The company you want to delete is linked to an order. Would you like to make the company Inactive?
tr_tr: Silmek istediğiniz şirketbir siparişe bağlı. Şirketi Pasif durumuna almak ister misiniz?

source: Passive Company
tr_tr: Şirketi Pasif Yap

# COMPANY_PASSIVED_SUCCESS
source: Company passived successfully
tr_tr: Şirket başarıyla pasif duruma getirildi

# ADMIN_INVALID_EMAIL_DOMAIN
source: Enter a valid email address. Only specific domains are allowed.
tr_tr: Geçerli bir e-posta adresi girin. Yalnızca belirli alanlara izin verilir.

# Invalid file type. Please upload an image file.
source: Please .png/.provide input in jpeg format.
tr_tr: Lütfen .png/.jpeg formatında giriş sağlayınız.

# EMPLOYEE_PHOTO_INVALID_FILE_TYPE
source: Photo field is not invalid file type. Please .png/.jpeg provide input in format.
tr_tr: Fotoğraf uygun formatta değil. Lütfen .png/.jpeg formatında giriş sağlayınız.

source: Product Type
tr_tr: Ürün Tipi

source: Warehouse Name
tr_tr: Depo Adı

# ForTürkiyeThePhoneNnumberMustBe10Digits.
source: For Türkiye, the phone number must be 10 digits.
tr_tr: Turkiye icin telefon numarasi 10 hanelidir.

source: Please enter a valid phone number.
tr_tr: Lutfen gecerli bir telefon numarasi giriniz.

source: The phone number is not valid in international format.
tr_tr: Telefon numarası uluslararası formatta olmalıdır.

# STOCK_TYPE_SIZE_CATEGORY_RELATION
source: Please select a category.
tr_tr: Lütfen kategori seçiniz.

# ADMIN_PHOTO_FORMAT
source: Only JPEG or PNG format photos are allowed.
tr_tr: Yalnızca JPEG veya PNG formatındaki fotoğraflara izin verilir.

source: First name must be between 2 and 50 characters and cannot contain numbers.
tr_tr: İsim 2 ile 50 karakter arasında olması gerekir ve sayı içeremez.

source: Last name must be between 2 and 50 characters and cannot contain numbers.
tr_tr: Soyadı 2 ile 50 karakter arasında olmalı ve sayı içermemelidir.

source: Search For Product
tr_tr: Ürün İçin Ara

# STOCK_PRODUCT_RELATION
source: Please select a product
tr_tr: Lütfen bir ürün seçiniz.

source: Remove Photo
tr_tr: Fotoğrafı Kaldır

source: This field is required.
tr_tr: Bu alan gereklidir.

source: Search Results...
tr_tr: Arama Sonuçları...

source: Please enter a valid phone number.
tr_tr: Lütfen geçerli bir telefon numarası girin.

# CountryCityError
source: Country or city entry is incorrect
tr_tr: Ülke veya şehir girişi hatalı

# NoCityFound
source: City not found
tr_tr: Şehir bulunamadı

# Phone_Error
source: Error
tr_tr: Hata

# Phone_Number_Error
source: The phone number or phone code you entered is incorrect
tr_tr: Telefon Numarası Veya Telefon Kodu Hatalı

# STOCK_TYPE_SIZE_DESCRIPTION_MAX_LENGTH
source: Description field cannot exceed 128 characters.
tr_tr: Açıklama alanı 128 karakterden uzun olamaz.

# STOCK_TYPE_SIZE_DESCRIPTION_MIN_LENGTH
source: Description field must be longer than 2 characters
tr_tr: Açıklama alanı 2 karakterden az olamaz.

# STOCK_TYPE_SIZE_DESCRIPTION_NOT_EMPTY
source: Description field connot be empty
tr_tr: Açıklama alanı boş bırakılamaz.

source: Passive
tr_tr: Pasif

source: Status
tr_tr: Durum

source: Status update failed.
tr_tr: Durum güncellemesi başarısız oldu.

source: The company status has been successfully pacified
tr_tr: Şirket durumu başarılı ile pasif hale getirildi.

source: The company status was activated with success.
tr_tr: Şirket durumu başarılı ile aktif hale getirildi.

source: Entries
tr_tr: Girişi

source: Show
tr_tr: Göster

source: Unit Price
tr_tr: Birim Fiyat

source: Add New Product
tr_tr: Yeni Ürün Ekle

source: Delete Product
tr_tr: Ürünü Sil

source: Select a Country
tr_tr: Ulke Seciniz

source: The City Name field is required.
tr_tr: Şehir Adı alanı gereklidir.

source: The City Name must be at least 2 characters long.
tr_tr: Şehir Adı en az 2 karakter uzunluğunda olmalıdır.

source: The Country field is required.
tr_tr: Ülke alanı gereklidir.

# BranchRequired
source: Please select a branch
tr_tr: Lütfen bir şube seçiniz

# Warehouse_DESCRIPTION_MIN_LENGTH
source: Address field cannot be less than 2 characters
tr_tr: Adres alanı 2 karakterden az olamaz

# Warehouse_DESCRIPTION_NOT_EMPTY
source: Address field cannot be empty
tr_tr: Adres alanı boş bırakılamaz

source: Active Orders
tr_tr: Aktif Olanlar

source: Inactive Orders
tr_tr: Aktif Olmayanlar

# OrderCreatedBy
source: Created By
tr_tr: Siparişi Oluşturan

source: Order Status
tr_tr: Sipariş Durumu

# Select_ProductType
source: Select a Product Type
tr_tr: Ürün Tipi Seçiniz

# PRODUCTTYPE_RELATION_ERROR
source: Product Type must be selected!
tr_tr: Ürün tipi seçilmelidir!

source: Order Summary
tr_tr: Sipariş Özeti

source: Grand Total Price
tr_tr: Genel Toplam Fiyat

# PRODUCTTYPE_CATEGORIES_NOT_EMPTY
source: Please select the product type's category
tr_tr: Lütfen ürün tipi için bir kategori seçiniz

# ColumnBranch
source: Branch
tr_tr: Şube

# ColumnCategory
source: Category
tr_tr: Kategori

# ColumnCompany
source: Company
tr_tr: Şirket

# ColumnCountry
source: Country
tr_tr: Ülke

# ColumnCreator
source: Created by
tr_tr: Oluşturan

# ColumnDate
source: Date
tr_tr: Tarih

# ColumnName
source: Name
tr_tr: Ad

# ColumnProduct
source: Product
tr_tr: Ürün

# ColumnStatus
source: Status
tr_tr: Durum

# ColumnSurname
source: Surname
tr_tr: Soyad
